//**********************************************************************
// 1. компилируем программу
// make имя.расширение
//
// Имя - name OR loops OR другие (создаем имя по назначению программы) |
// Рассширение - .c (язык С ) OR .cpp (язык С++)                       |
//
// 2. запускаем программу
// ./имя
//
// после изменений в программе, сохраняем файл и выполняем шаги 1 и 2
//
// Второй вариант компиляции програмы:
// 1.для языка С
// clang name.c -lcs50 -o name OR gcc numbers.c -lcs50 -o numbers
//
// 2.для языка С++
// clang++ name.cpp -o name OR g++ functions.cpp -o functions
//
//**********************************************************************